e2e/load/results/run2-no-ocr/k6-2vu.txt


  █ THRESHOLDS 

    http_req_duration{name:company_info}
    ✓ 'max>=0' max=81.37ms

    http_req_duration{name:dashboard}
    ✓ 'max>=0' max=156.17ms

    http_req_duration{name:invoice_pdf}
    ✓ 'max>=0' max=760.95ms

    http_req_duration{name:invoice_send}
    ✓ 'max>=0' max=238.15ms

    http_req_duration{name:list_clients}
    ✓ 'max>=0' max=50.61ms

    http_req_duration{name:list_invoices}
    ✓ 'max>=0' max=188.31ms

    http_req_duration{name:list_quotes}
    ✓ 'max>=0' max=92.92ms

    http_req_duration{name:login}
    ✓ 'max>=0' max=0s

    http_req_duration{name:ocr_upload}
    ✓ 'max>=0' max=0s

    http_req_duration{name:poll_invoice}
    ✓ 'max>=0' max=41.26ms

    http_req_duration{name:quote_convert}
    ✓ 'max>=0' max=233.98ms

    http_req_duration{name:quote_create}
    ✓ 'max>=0' max=954.25ms

    http_req_duration{name:session}
    ✓ 'max>=0' max=58.45ms


  █ TOTAL RESULTS 

    checks_total.......: 4056   13.446259/s
    checks_succeeded...: 99.50% 4036 out of 4056
    checks_failed......: 0.49%  20 out of 4056

    ✗ session 200
      ↳  93% — ✓ 292 / ✗ 20
    ✓ company_info 200
    ✓ dashboard 200
    ✓ list_quotes 200
    ✓ list_invoices 200
    ✓ list_clients 200
    ✓ quote_create 201
    ✓ quote_convert 201
    ✓ invoice_pdf 200
    ✓ pdf is a PDF
    ✓ invoice_send 201
    ✓ poll_invoice 200
    ✓ invoice sent

    CUSTOM
    send_to_sent...................: avg=1.03s    med=1.02s    p(95)=1.03s    p(99)=1.04s    max=1.04s    count=312 
    throttled_429..................: 20     0.066303/s

    HTTP
    http_req_duration..............: avg=84.63ms  med=40.22ms  p(95)=477.22ms p(99)=543.47ms max=954.25ms count=3432
      { expected_response:true }...: avg=85.02ms  med=40.3ms   p(95)=477.52ms p(99)=543.62ms max=954.25ms count=3412
      { name:company_info }........: avg=40.07ms  med=38.14ms  p(95)=54.61ms  p(99)=68.64ms  max=81.37ms  count=312 
      { name:dashboard }...........: avg=84.45ms  med=83.6ms   p(95)=117.43ms p(99)=133.75ms max=156.17ms count=312 
      { name:invoice_pdf }.........: avg=483.36ms med=484.03ms p(95)=562.86ms p(99)=595.38ms max=760.95ms count=312 
      { name:invoice_send }........: avg=62.44ms  med=59.07ms  p(95)=76.21ms  p(99)=157.89ms max=238.15ms count=312 
      { name:list_clients }........: avg=31.43ms  med=30.79ms  p(95)=39.37ms  p(99)=43.55ms  max=50.61ms  count=312 
      { name:list_invoices }.......: avg=36.17ms  med=33.97ms  p(95)=53.54ms  p(99)=68.72ms  max=188.31ms count=312 
      { name:list_quotes }.........: avg=38.25ms  med=35.19ms  p(95)=59.91ms  p(99)=72.83ms  max=92.92ms  count=312 
      { name:login }...............: avg=0s       med=0s       p(95)=0s       p(99)=0s       max=0s       count=0   
      { name:ocr_upload }..........: avg=0s       med=0s       p(95)=0s       p(99)=0s       max=0s       count=0   
      { name:poll_invoice }........: avg=29.36ms  med=28.75ms  p(95)=35.64ms  p(99)=39.51ms  max=41.26ms  count=312 
      { name:quote_convert }.......: avg=44.8ms   med=43.91ms  p(95)=53.19ms  p(99)=63.75ms  max=233.98ms count=312 
      { name:quote_create }........: avg=53.2ms   med=46.29ms  p(95)=55.38ms  p(99)=178.43ms max=954.25ms count=312 
      { name:session }.............: avg=27.44ms  med=27.34ms  p(95)=34.26ms  p(99)=39.01ms  max=58.45ms  count=312 
    http_req_failed................: 0.58%  20 out of 3432
    http_reqs......................: 3432   11.377604/s

    EXECUTION
    iteration_duration.............: avg=1.93s    med=1.92s    p(95)=2.06s    p(99)=2.22s    max=2.79s    count=312 
    iterations.....................: 312    1.034328/s
    vus............................: 2      min=2          max=2
    vus_max........................: 2      min=2          max=2

    NETWORK
    data_received..................: 50 MB  166 kB/s
    data_sent......................: 1.8 MB 5.9 kB/s